import 'package:flutter/material.dart';
import 'package:top10_movies/offline_page.dart';

class Movie extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Color(0xFFFCFAF8),
      body: ListView(
        children: <Widget>[
          SizedBox(height: 15.0),
          Container(
              padding: EdgeInsets.only(right: 15.0),
              width: MediaQuery.of(context).size.width,
              height: MediaQuery.of(context).size.height,
              child: GridView.count(
                crossAxisCount: 1,
                primary: false,
                crossAxisSpacing: 10.0,
                mainAxisSpacing: 15.0,
                childAspectRatio: 1.5,
                children: <Widget>[
                  _buildCard('Dark Soul Remaster', 'assets/dark.jpg', context,
                      'เกมต่อสู้ออฟไลน์ยอดนิยมสำหรับผู้ที่ชื่นชอบการ “เสพความตาย” ชอบเกมสู้ๆ ซาดิสม์ ตายแล้วตายอีกกับด่านหัวหน้าสู้ยากๆ หรือฮาร์ดคอร์เกมเมอร์ที่รู้สึกว่าเล่นเกม PC ออนไลน์ หรือเกมไหนมันก็ง่ายไปหมด มาลอง Dark Soul ดู สำหรับคอเกมส่วนใหญ่หลงใหลในความโหดหินของเกม บวกกับเนื้อเรื่องที่ลุ่มลึกสุดๆ ไอเทมทุกชิ้น บันทึกทุกเล่มที่คุณได้เจอ ล้วนแต่มีเรื่องราวของโลกดาร์กแฟนตาซีแห่งนี้ถ้าอยากลองเล่น แนะนำให้เริ่มตั้งแต่ภาคแรก ไม่ต้องห่วงว่าจะเป็นเกมเก่า เพราะตอนนี้เขามีเวอร์ชั่น remastered แล้ว ปรับปรุงข้อผิดพลาดต่างๆ แถมรันเฟรมเรทที่ 60 Fps ได้แล้วด้วย ส่วนเรื่องความคุ้มค่านี่ไม่ต้องพูดถึง เพราะถ้าคุณเป็นเกมเมอร์ที่มีความสามารถแบบคนทั่วไป แค่เคลียร์เนื้อเรื่องหลักก็ปาไป 40-50 ชั่วโมงแล้ว ถ้าจะเก็บเนื้อหาทั้งหมดก็ต้องเล่นเกม 100 ชม. ขึ้นไป เล่นได้คุ้มแน่นอน'),
                  _buildCard('Far Cry 5', 'assets/far.jpg', context,
                      'มาที่เกมออฟไลน์มันๆ สำหรับสายยิงกันบ้าง กับซีรีส์เกมยอดนิยมตลอดกาล Far Cry ที่เดินทางมาถึงภาค 5 แล้ว แต่ถึงก่อนหน้านี้จะไม่ได้เล่นภาคก่อนหน้ามา ก็เล่นได้สนุกอยู่ เพราะเนื้อเรื่องในแต่ละภาคจะไม่ได้เกี่ยวข้องอะไรกัน จะมาเริ่มเล่นภาคนี้เลยก็ย่อมได้ โดย Far Cry ภาคนี้มีฉากหลังเป็นจังหวัดชายขอบของสหรัฐอเมริกา มีฟีเจอร์เด็ดคือสามารถเล่นกับเพื่อน 2 คนหรือจะเล่นคนเดียวก็ได้ เพื่อต่อสู้พิทักษ์ความอยู่รอดและเสรีภาพของผู้คนหรือตัวละครที่อยู่ในเกม แน่นอนว่าองค์ประกอบของความเป็น Far Cry ที่เป็นเสน่ห์ของเกมเลยก็ว่าได้ ยังอยู่ครบหมด เนื้อเรื่องเข้มข้น ทำภารกิจต่างๆ ยึดค่าย ล่าสัตว์มาอัปเกรดของ แถมมีฉากจบหลายแบบด้วย ซึ่งทั้งหมดขึ้นอยู่กับการกระทำของผู้เล่นล้วนๆ'),
                  _buildCard('Journey', 'assets/jour.jpg', context,
                      'มาที่เกมออฟไลน์ PC สเปคต่ำ แต่ภาพสวย แถมเนื้องเรื่องและเพลงประกอบก็ดี๊ดีจนอยากบอกต่อ เราจะได้รับบทเป็นนักสำรวจเพื่อออกสำรวจโลกยุคโบราณอันลี้ลับ น่าพิศวง เหนือทะเลทรายและซากปรักหักพังที่รอให้เรามาเปิดเผยความลับที่ซ่อนเอาไว้ เล่นคนเดียวก็ได้ หรืออยากรวมทีมกับเพื่อนก็ดี เป็นเกมแนวผจญภัย ไขปริศนา ราคาไม่แพงแต่เล่นเพลินไม่แพ้เกมใหญ่ แถมภาพและเสียงก็งดงามตระการตา เป็นอีกหนึ่งเกม PC ที่เราอยากแนะนำสำหรับคนที่หาเกมแนว puzzle ภาพสวยๆ ไว้เล่นแก้เบื่อค่ะ'),
                  _buildCard(
                      'The Elder Scrolls V: Skyrim Special Edition',
                      'assets/the.jpg',
                      context,
                      'สุดยอดเกม MMORPG Openworld ในตำนาน ที่แม้จะวางจำหน่ายมาหลายปีแต่ก็ยังได้รับความนิยมไม่เปลี่ยน มีการอัปเดตและยังคงมีกลุ่มผู้เล่นออกมาพูดคุยแลกเปลี่ยนประสบการณ์และเนื้อหาดัดแปลงที่เรียกว่า Mod เพื่อเสริมความแปลกใหม่ให้ตัวเกมอยู่เสมอ ในเรื่องเราจะได้รับบทเป็น Dragonborn นักรบในตำนานของโลก Skyrim ขอบอกว่าใครเล่นเกมแนวสวมบทบาท ออกเดินทางทำภารกิจ ปราบปีศาจ ล่ามังกร ต้องไม่พลาดค่ะ นอกจากระบบเกมจะคลาสสิกทำให้เราติดงอมแงมแล้ว สิ่งที่ดีงามอีกอย่างของ Skyrim ก็คือเนื้อเรื่องที่ลุ่มลึก ชวนติดตาม ใครได้เล่นรับรองว่าเผลอแปปเดียวฟ้าสว่างแบบไม่รู้ตัวเลยหล่ะ'),
                  _buildCard('This War of Mine', 'assets/this.jpg', context,
                      'เกมออฟไลน์ PC สเปคต่ำ แต่เนื้อเรื่องดีจนผู้เล่นหลายคนแนะนำ ในเกมนี้เราจะได้สำรวจโลกหลังสงครามที่ขาดแคลนน้ำ อาหาร ที่อยู่อาศัย ท่ามกลางธีมดาร์กๆ หม่นๆ ชวนหดหู่ เราจะได้พบกับเนื้อเรื่องของตัวละครตามรายทาง ที่บางครั้งก็ชวนตลกร้าย แต่บางครั้งก็ชวนให้อึดอัดกับทางเลือกที่ต้องตัดสินใจ เราต้องเอาตัวรอดไปให้ได้พร้อมๆ กับเลือกเส้นทางการตัดสินใจของตัวละคร ส่วนบทสรุปจะเป็นอย่างไรนั้น ต้องลองไปเล่นกันดูนะคะ'),
                  _buildCard(
                      'Plague Inc: Evolved',
                      'assets/plague.jpg',
                      context,
                      'เกม Plague Inc: Evolved เป็น เกมออฟไลน์ PC สเปคต่ำที่วางจำหน่ายมาหลายปี แต่กลับมาดังเป็นพลุแตกเพราะไวรัสโควิด-19 ระบาดแล้วมีผู้เล่นสร้าง Mod เพื่อเปลี่ยนการเล่นเกมธรรมดาให้เป็นการจำลองการแพร่ระบาดของไวรัสโควิด-19 จนตัวเกมกลับมาขายดีอีกครั้ง และผู้พัฒนาก็ออกเนื้อหาอัปเดตใหม่ๆ มาให้เราได้เล่นกันด้วย ในเกมนี้เราไม่ได้รับบทเป็นคนดีช่วยโลก แต่เราคือผู้ปล่อยเชื้อไวรัสและต้องทำให้คนทั้งโลกติดไวรัสทั้งหมดให้ได้ก่อนที่องค์การอนามัยโลก (WHO) จะหาวัคซีนต่อต้านเราได้สำเร็จ ซึ่งในเกมเราสามารถเลือกเชื้อโรคได้หลายรูปแบบ ทั้งไวรัส แบคทีเรีย เชื้อรา หรือเชื้อแปลกๆ อย่างแวมไพร์ ซอมบี้ ไปจนถึงเชื้อไวรัสจากเรื่อง Planet of The Ape ก็มี อย่าเพิ่งคิดว่าระบบเกมไม่น่ามีอะไร เพราะแค่ปล่อยเชื้อโรค อัปเกรดเชื้อโรค ก็ทำให้คนเล่นอย่างเราติดงอมแงมได้แบบไม่รู้ตัว '),
                  _buildCard(
                      'Call of Duty: Black Ops Cold War',
                      'assets/BOCW_MP_WM_Tout.jpg',
                      context,
                      'ยอดเกมดังที่จะไม่พูดถึงก็คงไม่ได้ โดยเกมใน Series ของ Call of Duty นั้นมักจะทำออกมาวางขายกันอยู่ทุกปี เพื่อให้แฟนๆ ได้เล่นเนื้อเรื่องกันเรื่อยๆ ต่อจากภาค Modern Warfare ในปีนี้ก็เป็นส่วนของภาค Black Ops Cold War ที่ได้เล่าเรื่องราวของ Bell สมาชิกของหน่วย CIA ที่ต้องเข้าไปทำภารกิจให้ลุล่วง ถึงแม้ว่าเกมนี้ หลานคนจะเล่นแบบ Single Player แต่ตัวเกมก็ยังคงมีแบบออนไลน์ให้เล่นแบบ Multiplayer อีกด้วย โดยโหมดนี้จะแบ่งผู้เล่นเป็น 6 ต่อ 6 คน และก็มีโหมดพิเศษเพิ่มเข้ามาเป็น 12 ต่อ 12 คนด้วย และสุดท้ายคือแบบ Fireteam ที่ให้ผู้เล่นเข้าไปเล่นได้ถึง 40 คน แบ่งออกเป็น 10 ทีมเพื่อต่อสู้แย่งชิงแร่ยูเรเนียม และจุดระเบิดให้สำเร็จ นอกจากบน PC แล้วเกม Call of Duty ก็ยังมีเวอร์ชันบนมือถือ ที่ฮิตไม่แพ้กันเลย ใครชอบเกมแนวยิงกัน ไม่ควรพลาดเกมนี้เลย'),
                  _buildCard('Watch Dogs: Legion', 'assets/watch.jpg', context,
                      'Watch Dogs เกมที่มีชื่อเสียงโด่งดังจากค่าย Ubisoft แถมยังปล่อยออกมาให้เล่นกันเกือบทุกแพลตฟอร์ม ซึ่งในภาคนี้ก็ทำออกมาได้อย่างน่าสนใจ ด้วยการเล่นแบบที่เราจะสามารถเป็นใครก็ได้ในเกมแบบ Play as Anyone เพื่อดำเนินเนื้อเรื่อง กับการทำภารกิจสร้างกองกำลังต่อต้านเผด็จการ และช่วยกู้คืนเมือง London ให้กลับมาเป็นเหมือนเดิมให้ได้ ถึงแม้ว่าเกมนี้จะปล่อยออกมาในตอนนี้ และยังเล่นได้แบบ Single Player อยู่ และมีการอัพเดทให้เล่นแบบ Multiplayer ในแบบเดโม่มาให้ลองกันบ้าง แต่ก็ต้องรอการอัพเดทที่เลื่อนไปถึงต้นปี 2021 กันเลย โดยในโหมดออนไลน์นั้น สามารถเล่นแบบภารกิจ Co-op 4 คน อีเวนท์ต่างๆ และแบบ PvP ได้อีกด้วย เราเลยขอนำเกมนี้มารวมอยู่ในเกมออนไลน์ 2020 ด้วยก่อนเลย เพื่อรอปีหน้าแบบเต็มตัว'),
                ],
              )),
          SizedBox(height: 15.0)
        ],
      ),
    );
  }

  Widget _buildCard(String namess, String img, context, spoils) {
    return Padding(
        padding: EdgeInsets.only(top: 5.0, bottom: 5.0, left: 5.0, right: 5.0),
        child: InkWell(
            onTap: () {
              Navigator.of(context).push(MaterialPageRoute(
                  builder: (context) => offlinegame(
                        Path: img,
                        names: namess,
                        details: spoils,
                      )));
            },
            child: Container(
                decoration: BoxDecoration(
                    image: DecorationImage(
                        image: AssetImage(img), fit: BoxFit.cover),
                    borderRadius: BorderRadius.circular(15.0),
                    boxShadow: [
                      BoxShadow(
                          color: Colors.grey.withOpacity(0.2),
                          spreadRadius: 3.0,
                          blurRadius: 5.0)
                    ],
                    color: Colors.white),
                child: Align(
                    alignment: Alignment(0, 0.9),
                    child: Text(
                      namess,
                      textAlign: TextAlign.center,
                      style: TextStyle(
                          color: Color(0xFFFFFFFF),
                          fontSize: 20.0,
                          backgroundColor: Colors.black.withOpacity(0.75)),
                    )))));
  }
}
